   - [#   1] AOD constaints: 
--------------------------------------------------------------------------------
   75:         passes = False
   76:     if not (checkFullMoon(booking[0], booking[1])):
   77:         errorMSG += 'book not on a full moon, '
   78:         passes = False
-  79:     return [passes, errorMSG[:-2]]
+  79:     return [passes, errorMSG[:2]]
   80: 
   81: 
   82: def form2Checks(booking):
   83:     
--------------------------------------------------------------------------------
[11.66917 s] survived

   - [#   2] AOR constaints: 
--------------------------------------------------------------------------------
   75:         passes = False
   76:     if not (checkFullMoon(booking[0], booking[1])):
   77:         errorMSG += 'book not on a full moon, '
   78:         passes = False
-  79:     return [passes, errorMSG[:-2]]
+  79:     return [passes, errorMSG[:+2]]
   80: 
   81: 
   82: def form2Checks(booking):
   83:     
--------------------------------------------------------------------------------
[11.45242 s] survived

   - [#   3] AOR constaints: 
--------------------------------------------------------------------------------
  182:     elif meetLength == 2:
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
  185:                 if (j[7] == i or j[7] == str(
- 186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
+ 186:                     (datetime.strptime(i, '%H:%M') - timedelta(hours=1)).strftime(
  187:                     '%H:%M'))):
  188:                     
  189:                     
  190:                     addTime = False
--------------------------------------------------------------------------------
[11.52662 s] survived

   - [#   4] AOR constaints: 
--------------------------------------------------------------------------------
  197:                 if \
  198:                     (j[7] == i or \
  199:                     j[7] == \
  200:                     str(
- 201:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
+ 201:                     (datetime.strptime(i, '%H:%M') - timedelta(hours=1)).strftime(
  202:                     '%H:%M')) or \
  203:                     \
  204:                     \
  205:                     j[7] == \
--------------------------------------------------------------------------------
[11.84732 s] survived

   - [#   5] AOR constaints: 
--------------------------------------------------------------------------------
  203:                     \
  204:                     \
  205:                     j[7] == \
  206:                     str(
- 207:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=2)).strftime(
+ 207:                     (datetime.strptime(i, '%H:%M') - timedelta(hours=2)).strftime(
  208:                     '%H:%M'))):
  209:                     
  210:                     
  211:                     
--------------------------------------------------------------------------------
[11.48249 s] survived

   - [#   6] AOR constaints: 
--------------------------------------------------------------------------------
  220:     
  221:     d = open('bookings.csv', 'a')
  222:     for i in range(int(booking[3][0])):
  223:         d.write('\n')
- 224:         lenght = str(int(str(booking[3][0])) - i) + ' hours'
+ 224:         lenght = str(int(str(booking[3][0])) + i) + ' hours'
  225:         time = str(
  226:             (datetime.strptime(booking[7], '%H:%M') + timedelta(hours=i)).strftime(
  227:             '%H:%M'))
  228:         
--------------------------------------------------------------------------------
[11.43832 s] survived

   - [#   7] AOR constaints: 
--------------------------------------------------------------------------------
  220:     
  221:     d = open('bookings.csv', 'a')
  222:     for i in range(int(booking[3][0])):
  223:         d.write('\n')
- 224:         lenght = str(int(str(booking[3][0])) - i) + ' hours'
+ 224:         lenght = str(int(str(booking[3][0])) - i) - ' hours'
  225:         time = str(
  226:             (datetime.strptime(booking[7], '%H:%M') + timedelta(hours=i)).strftime(
  227:             '%H:%M'))
  228:         
--------------------------------------------------------------------------------
[11.48748 s] survived

   - [#   8] AOR constaints: 
--------------------------------------------------------------------------------
  222:     for i in range(int(booking[3][0])):
  223:         d.write('\n')
  224:         lenght = str(int(str(booking[3][0])) - i) + ' hours'
  225:         time = str(
- 226:             (datetime.strptime(booking[7], '%H:%M') + timedelta(hours=i)).strftime(
+ 226:             (datetime.strptime(booking[7], '%H:%M') - timedelta(hours=i)).strftime(
  227:             '%H:%M'))
  228:         
  229:         
  230:         d.write(
--------------------------------------------------------------------------------
[11.52404 s] survived

   - [#   9] AOR constaints: 
--------------------------------------------------------------------------------
  227:             '%H:%M'))
  228:         
  229:         
  230:         d.write(
- 231:             (((((((((((((str(booking[0].name) + \
+ 231:             (((((((((((((str(booking[0].name) - \
  232:             ',') + \
  233:             str(booking[1])) + \
  234:             ',') + \
  235:             str(booking[2])) + \
--------------------------------------------------------------------------------
[11.40261 s] survived

   - [#  10] AOR constaints: 
--------------------------------------------------------------------------------
  228:         
  229:         
  230:         d.write(
  231:             (((((((((((((str(booking[0].name) + \
- 232:             ',') + \
+ 232:             ',') - \
  233:             str(booking[1])) + \
  234:             ',') + \
  235:             str(booking[2])) + \
  236:             ',') + \
--------------------------------------------------------------------------------
[11.47013 s] survived

   - [#  11] AOR constaints: 
--------------------------------------------------------------------------------
  229:         
  230:         d.write(
  231:             (((((((((((((str(booking[0].name) + \
  232:             ',') + \
- 233:             str(booking[1])) + \
+ 233:             str(booking[1])) - \
  234:             ',') + \
  235:             str(booking[2])) + \
  236:             ',') + \
  237:             lenght) + \
--------------------------------------------------------------------------------
[11.43388 s] survived

   - [#  12] AOR constaints: 
--------------------------------------------------------------------------------
  230:         d.write(
  231:             (((((((((((((str(booking[0].name) + \
  232:             ',') + \
  233:             str(booking[1])) + \
- 234:             ',') + \
+ 234:             ',') - \
  235:             str(booking[2])) + \
  236:             ',') + \
  237:             lenght) + \
  238:             ',') + \
--------------------------------------------------------------------------------
[11.48018 s] survived

   - [#  13] AOR constaints: 
--------------------------------------------------------------------------------
  231:             (((((((((((((str(booking[0].name) + \
  232:             ',') + \
  233:             str(booking[1])) + \
  234:             ',') + \
- 235:             str(booking[2])) + \
+ 235:             str(booking[2])) - \
  236:             ',') + \
  237:             lenght) + \
  238:             ',') + \
  239:             str(booking[4])) + \
--------------------------------------------------------------------------------
[11.73396 s] survived

   - [#  14] AOR constaints: 
--------------------------------------------------------------------------------
  232:             ',') + \
  233:             str(booking[1])) + \
  234:             ',') + \
  235:             str(booking[2])) + \
- 236:             ',') + \
+ 236:             ',') - \
  237:             lenght) + \
  238:             ',') + \
  239:             str(booking[4])) + \
  240:             ',') + \
--------------------------------------------------------------------------------
[11.49725 s] survived

   - [#  15] AOR constaints: 
--------------------------------------------------------------------------------
  233:             str(booking[1])) + \
  234:             ',') + \
  235:             str(booking[2])) + \
  236:             ',') + \
- 237:             lenght) + \
+ 237:             lenght) - \
  238:             ',') + \
  239:             str(booking[4])) + \
  240:             ',') + \
  241:             str(booking[5])) + \
--------------------------------------------------------------------------------
[11.49265 s] survived

   - [#  16] AOR constaints: 
--------------------------------------------------------------------------------
  234:             ',') + \
  235:             str(booking[2])) + \
  236:             ',') + \
  237:             lenght) + \
- 238:             ',') + \
+ 238:             ',') - \
  239:             str(booking[4])) + \
  240:             ',') + \
  241:             str(booking[5])) + \
  242:             ',') + \
--------------------------------------------------------------------------------
[11.46314 s] survived

   - [#  17] AOR constaints: 
--------------------------------------------------------------------------------
  235:             str(booking[2])) + \
  236:             ',') + \
  237:             lenght) + \
  238:             ',') + \
- 239:             str(booking[4])) + \
+ 239:             str(booking[4])) - \
  240:             ',') + \
  241:             str(booking[5])) + \
  242:             ',') + \
  243:             str(booking[6])) + \
--------------------------------------------------------------------------------
[11.47233 s] survived

   - [#  18] AOR constaints: 
--------------------------------------------------------------------------------
  236:             ',') + \
  237:             lenght) + \
  238:             ',') + \
  239:             str(booking[4])) + \
- 240:             ',') + \
+ 240:             ',') - \
  241:             str(booking[5])) + \
  242:             ',') + \
  243:             str(booking[6])) + \
  244:             ',') + \
--------------------------------------------------------------------------------
[11.46834 s] survived

   - [#  19] AOR constaints: 
--------------------------------------------------------------------------------
  237:             lenght) + \
  238:             ',') + \
  239:             str(booking[4])) + \
  240:             ',') + \
- 241:             str(booking[5])) + \
+ 241:             str(booking[5])) - \
  242:             ',') + \
  243:             str(booking[6])) + \
  244:             ',') + \
  245:             time)
--------------------------------------------------------------------------------
[11.48875 s] survived

   - [#  20] AOR constaints: 
--------------------------------------------------------------------------------
  238:             ',') + \
  239:             str(booking[4])) + \
  240:             ',') + \
  241:             str(booking[5])) + \
- 242:             ',') + \
+ 242:             ',') - \
  243:             str(booking[6])) + \
  244:             ',') + \
  245:             time)
  246:     
--------------------------------------------------------------------------------
[11.47335 s] survived

   - [#  21] AOR constaints: 
--------------------------------------------------------------------------------
  239:             str(booking[4])) + \
  240:             ',') + \
  241:             str(booking[5])) + \
  242:             ',') + \
- 243:             str(booking[6])) + \
+ 243:             str(booking[6])) - \
  244:             ',') + \
  245:             time)
  246:     
  247:     
--------------------------------------------------------------------------------
[11.89607 s] survived

   - [#  22] AOR constaints: 
--------------------------------------------------------------------------------
  240:             ',') + \
  241:             str(booking[5])) + \
  242:             ',') + \
  243:             str(booking[6])) + \
- 244:             ',') + \
+ 244:             ',') - \
  245:             time)
  246:     
  247:     
  248:     d.close()
--------------------------------------------------------------------------------
[11.58496 s] survived

   - [#  23] AOR constaints: 
--------------------------------------------------------------------------------
  275: 
  276: def checkTimeInAdvance(now, dateS, bookingTime):
  277:     
  278:     
- 279:     minBookTime = now + timedelta(hours=3)
+ 279:     minBookTime = now - timedelta(hours=3)
  280:     bookingTime = datetime.strptime(bookingTime, '%H:%M')
  281:     if (now.date() == dateS and minBookTime.time() > bookingTime.time()):
  282:         return False
  283:     else:
--------------------------------------------------------------------------------
[11.50535 s] survived

   - [#  24] ASR constaints: 
--------------------------------------------------------------------------------
   58:     
   59:     errorMSG = "You can't: "
   60:     passes = True
   61:     if not (checkWeekend(booking[1])):
-  62:         errorMSG += 'book on weekends, '
+  62:         errorMSG -= 'book on weekends, '
   63:         passes = False
   64:     if not (checkHoliday(booking[1])):
   65:         errorMSG += 'book on holidays, '
   66:         passes = False
--------------------------------------------------------------------------------
[11.85766 s] survived

   - [#  25] ASR constaints: 
--------------------------------------------------------------------------------
   61:     if not (checkWeekend(booking[1])):
   62:         errorMSG += 'book on weekends, '
   63:         passes = False
   64:     if not (checkHoliday(booking[1])):
-  65:         errorMSG += 'book on holidays, '
+  65:         errorMSG -= 'book on holidays, '
   66:         passes = False
   67:     if not (checkNulls(booking)):
   68:         errorMSG += 'leave any fields blank, '
   69:         passes = False
--------------------------------------------------------------------------------
[11.76962 s] survived

   - [#  26] ASR constaints: 
--------------------------------------------------------------------------------
   64:     if not (checkHoliday(booking[1])):
   65:         errorMSG += 'book on holidays, '
   66:         passes = False
   67:     if not (checkNulls(booking)):
-  68:         errorMSG += 'leave any fields blank, '
+  68:         errorMSG -= 'leave any fields blank, '
   69:         passes = False
   70:     if not (ageRange(booking[0], booking[4])):
   71:         errorMSG += 'book with this age range, '
   72:         passes = False
--------------------------------------------------------------------------------
[11.43852 s] survived

   - [#  27] ASR constaints: 
--------------------------------------------------------------------------------
   67:     if not (checkNulls(booking)):
   68:         errorMSG += 'leave any fields blank, '
   69:         passes = False
   70:     if not (ageRange(booking[0], booking[4])):
-  71:         errorMSG += 'book with this age range, '
+  71:         errorMSG -= 'book with this age range, '
   72:         passes = False
   73:     if not (maxOcc(booking[0], int(booking[2]))):
   74:         errorMSG += 'have that many people in this room, '
   75:         passes = False
--------------------------------------------------------------------------------
[11.50698 s] survived

   - [#  28] ASR constaints: 
--------------------------------------------------------------------------------
   70:     if not (ageRange(booking[0], booking[4])):
   71:         errorMSG += 'book with this age range, '
   72:         passes = False
   73:     if not (maxOcc(booking[0], int(booking[2]))):
-  74:         errorMSG += 'have that many people in this room, '
+  74:         errorMSG -= 'have that many people in this room, '
   75:         passes = False
   76:     if not (checkFullMoon(booking[0], booking[1])):
   77:         errorMSG += 'book not on a full moon, '
   78:         passes = False
--------------------------------------------------------------------------------
[12.75634 s] survived

   - [#  29] ASR constaints: 
--------------------------------------------------------------------------------
   73:     if not (maxOcc(booking[0], int(booking[2]))):
   74:         errorMSG += 'have that many people in this room, '
   75:         passes = False
   76:     if not (checkFullMoon(booking[0], booking[1])):
-  77:         errorMSG += 'book not on a full moon, '
+  77:         errorMSG -= 'book not on a full moon, '
   78:         passes = False
   79:     return [passes, errorMSG[:-2]]
   80: 
   81: 
--------------------------------------------------------------------------------
[11.44047 s] survived

   - [#  30] ASR constaints: 
--------------------------------------------------------------------------------
   84:     
   85:     errorMSG = ''
   86:     passes = True
   87:     if not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)):
-  88:         errorMSG += 'You already have a booking at this time, '
+  88:         errorMSG -= 'You already have a booking at this time, '
   89:         passes = False
   90:     if not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])):
   91:         errorMSG += "You can't book less than 3 hours in advance, "
   92:         passes = False
--------------------------------------------------------------------------------
[11.42853 s] survived

   - [#  31] ASR constaints: 
--------------------------------------------------------------------------------
   87:     if not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)):
   88:         errorMSG += 'You already have a booking at this time, '
   89:         passes = False
   90:     if not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])):
-  91:         errorMSG += "You can't book less than 3 hours in advance, "
+  91:         errorMSG -= "You can't book less than 3 hours in advance, "
   92:         passes = False
   93:     return [passes, errorMSG[:2]]
   94: 
   95: 
--------------------------------------------------------------------------------
[11.46808 s] survived

   - [#  34] COD constaints: 
--------------------------------------------------------------------------------
   57:     
   58:     
   59:     errorMSG = "You can't: "
   60:     passes = True
-  61:     if not (checkWeekend(booking[1])):
+  61:     if checkWeekend(booking[1]):
   62:         errorMSG += 'book on weekends, '
   63:         passes = False
   64:     if not (checkHoliday(booking[1])):
   65:         errorMSG += 'book on holidays, '
--------------------------------------------------------------------------------
[11.41030 s] survived

   - [#  35] COD constaints: 
--------------------------------------------------------------------------------
   60:     passes = True
   61:     if not (checkWeekend(booking[1])):
   62:         errorMSG += 'book on weekends, '
   63:         passes = False
-  64:     if not (checkHoliday(booking[1])):
+  64:     if checkHoliday(booking[1]):
   65:         errorMSG += 'book on holidays, '
   66:         passes = False
   67:     if not (checkNulls(booking)):
   68:         errorMSG += 'leave any fields blank, '
--------------------------------------------------------------------------------
[11.43065 s] survived

   - [#  36] COD constaints: 
--------------------------------------------------------------------------------
   63:         passes = False
   64:     if not (checkHoliday(booking[1])):
   65:         errorMSG += 'book on holidays, '
   66:         passes = False
-  67:     if not (checkNulls(booking)):
+  67:     if checkNulls(booking):
   68:         errorMSG += 'leave any fields blank, '
   69:         passes = False
   70:     if not (ageRange(booking[0], booking[4])):
   71:         errorMSG += 'book with this age range, '
--------------------------------------------------------------------------------
[11.47294 s] survived

   - [#  37] COD constaints: 
--------------------------------------------------------------------------------
   66:         passes = False
   67:     if not (checkNulls(booking)):
   68:         errorMSG += 'leave any fields blank, '
   69:         passes = False
-  70:     if not (ageRange(booking[0], booking[4])):
+  70:     if ageRange(booking[0], booking[4]):
   71:         errorMSG += 'book with this age range, '
   72:         passes = False
   73:     if not (maxOcc(booking[0], int(booking[2]))):
   74:         errorMSG += 'have that many people in this room, '
--------------------------------------------------------------------------------
[11.43129 s] survived

   - [#  38] COD constaints: 
--------------------------------------------------------------------------------
   69:         passes = False
   70:     if not (ageRange(booking[0], booking[4])):
   71:         errorMSG += 'book with this age range, '
   72:         passes = False
-  73:     if not (maxOcc(booking[0], int(booking[2]))):
+  73:     if maxOcc(booking[0], int(booking[2])):
   74:         errorMSG += 'have that many people in this room, '
   75:         passes = False
   76:     if not (checkFullMoon(booking[0], booking[1])):
   77:         errorMSG += 'book not on a full moon, '
--------------------------------------------------------------------------------
[11.40031 s] survived

   - [#  39] COD constaints: 
--------------------------------------------------------------------------------
   72:         passes = False
   73:     if not (maxOcc(booking[0], int(booking[2]))):
   74:         errorMSG += 'have that many people in this room, '
   75:         passes = False
-  76:     if not (checkFullMoon(booking[0], booking[1])):
+  76:     if checkFullMoon(booking[0], booking[1]):
   77:         errorMSG += 'book not on a full moon, '
   78:         passes = False
   79:     return [passes, errorMSG[:-2]]
   80: 
--------------------------------------------------------------------------------
[11.49854 s] survived

   - [#  40] COD constaints: 
--------------------------------------------------------------------------------
   83:     
   84:     
   85:     errorMSG = ''
   86:     passes = True
-  87:     if not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)):
+  87:     if userBooked(booking[5], booking[6], booking[1], booking[7], bookings):
   88:         errorMSG += 'You already have a booking at this time, '
   89:         passes = False
   90:     if not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])):
   91:         errorMSG += "You can't book less than 3 hours in advance, "
--------------------------------------------------------------------------------
[11.42500 s] survived

   - [#  41] COD constaints: 
--------------------------------------------------------------------------------
   86:     passes = True
   87:     if not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)):
   88:         errorMSG += 'You already have a booking at this time, '
   89:         passes = False
-  90:     if not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])):
+  90:     if checkTimeInAdvance(datetime.now(), booking[1], booking[7]):
   91:         errorMSG += "You can't book less than 3 hours in advance, "
   92:         passes = False
   93:     return [passes, errorMSG[:2]]
   94: 
--------------------------------------------------------------------------------
[11.42665 s] survived

   - [#  42] COD constaints: 
--------------------------------------------------------------------------------
  160:         if i:
  161:             if (i[1] == date and i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
- 164:     if not daysBookings:
+ 164:     if daysBookings:
  165:         if meetLength == 1:
  166:             return usableTimes
  167:         if meetLength == 2:
  168:             return usableTimes[:9]
--------------------------------------------------------------------------------
[11.48763 s] survived

   - [#  43] COI constaints: 
--------------------------------------------------------------------------------
   57:     
   58:     
   59:     errorMSG = "You can't: "
   60:     passes = True
-  61:     if not (checkWeekend(booking[1])):
+  61:     if not ((not (checkWeekend(booking[1])))):
   62:         errorMSG += 'book on weekends, '
   63:         passes = False
   64:     if not (checkHoliday(booking[1])):
   65:         errorMSG += 'book on holidays, '
--------------------------------------------------------------------------------
[11.44449 s] survived

   - [#  44] COI constaints: 
--------------------------------------------------------------------------------
   60:     passes = True
   61:     if not (checkWeekend(booking[1])):
   62:         errorMSG += 'book on weekends, '
   63:         passes = False
-  64:     if not (checkHoliday(booking[1])):
+  64:     if not ((not (checkHoliday(booking[1])))):
   65:         errorMSG += 'book on holidays, '
   66:         passes = False
   67:     if not (checkNulls(booking)):
   68:         errorMSG += 'leave any fields blank, '
--------------------------------------------------------------------------------
[11.41871 s] survived

   - [#  45] COI constaints: 
--------------------------------------------------------------------------------
   63:         passes = False
   64:     if not (checkHoliday(booking[1])):
   65:         errorMSG += 'book on holidays, '
   66:         passes = False
-  67:     if not (checkNulls(booking)):
+  67:     if not ((not (checkNulls(booking)))):
   68:         errorMSG += 'leave any fields blank, '
   69:         passes = False
   70:     if not (ageRange(booking[0], booking[4])):
   71:         errorMSG += 'book with this age range, '
--------------------------------------------------------------------------------
[11.48457 s] survived

   - [#  46] COI constaints: 
--------------------------------------------------------------------------------
   66:         passes = False
   67:     if not (checkNulls(booking)):
   68:         errorMSG += 'leave any fields blank, '
   69:         passes = False
-  70:     if not (ageRange(booking[0], booking[4])):
+  70:     if not ((not (ageRange(booking[0], booking[4])))):
   71:         errorMSG += 'book with this age range, '
   72:         passes = False
   73:     if not (maxOcc(booking[0], int(booking[2]))):
   74:         errorMSG += 'have that many people in this room, '
--------------------------------------------------------------------------------
[11.50227 s] survived

   - [#  47] COI constaints: 
--------------------------------------------------------------------------------
   69:         passes = False
   70:     if not (ageRange(booking[0], booking[4])):
   71:         errorMSG += 'book with this age range, '
   72:         passes = False
-  73:     if not (maxOcc(booking[0], int(booking[2]))):
+  73:     if not ((not (maxOcc(booking[0], int(booking[2]))))):
   74:         errorMSG += 'have that many people in this room, '
   75:         passes = False
   76:     if not (checkFullMoon(booking[0], booking[1])):
   77:         errorMSG += 'book not on a full moon, '
--------------------------------------------------------------------------------
[11.44181 s] survived

   - [#  48] COI constaints: 
--------------------------------------------------------------------------------
   72:         passes = False
   73:     if not (maxOcc(booking[0], int(booking[2]))):
   74:         errorMSG += 'have that many people in this room, '
   75:         passes = False
-  76:     if not (checkFullMoon(booking[0], booking[1])):
+  76:     if not ((not (checkFullMoon(booking[0], booking[1])))):
   77:         errorMSG += 'book not on a full moon, '
   78:         passes = False
   79:     return [passes, errorMSG[:-2]]
   80: 
--------------------------------------------------------------------------------
[11.43503 s] survived

   - [#  49] COI constaints: 
--------------------------------------------------------------------------------
   83:     
   84:     
   85:     errorMSG = ''
   86:     passes = True
-  87:     if not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)):
+  87:     if not ((not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)))):
   88:         errorMSG += 'You already have a booking at this time, '
   89:         passes = False
   90:     if not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])):
   91:         errorMSG += "You can't book less than 3 hours in advance, "
--------------------------------------------------------------------------------
[11.43611 s] survived

   - [#  50] COI constaints: 
--------------------------------------------------------------------------------
   86:     passes = True
   87:     if not (userBooked(booking[5], booking[6], booking[1], booking[7], bookings)):
   88:         errorMSG += 'You already have a booking at this time, '
   89:         passes = False
-  90:     if not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])):
+  90:     if not ((not (checkTimeInAdvance(datetime.now(), booking[1], booking[7])))):
   91:         errorMSG += "You can't book less than 3 hours in advance, "
   92:         passes = False
   93:     return [passes, errorMSG[:2]]
   94: 
--------------------------------------------------------------------------------
[11.44537 s] survived
