   - [#  51] COI constaints: 
--------------------------------------------------------------------------------
   96: def getRoom(roomName):
   97:     
   98:     
   99:     for room in allRooms:
- 100:         if room.name == roomName:
+ 100:         if not (room.name == roomName):
  101:             return room
  102:     return False
  103: 
  104: 
--------------------------------------------------------------------------------
[11.40454 s] survived

   - [#  52] COI constaints: 
--------------------------------------------------------------------------------
  105: def ageRange(room, age):
  106:     
  107:     
  108:     for r in allRooms:
- 109:         if room.name == r.name:
+ 109:         if not (room.name == r.name):
  110:             maxAge = r.maxAge
  111:             minAge = r.minAge
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
--------------------------------------------------------------------------------
[11.41707 s] survived

   - [#  53] COI constaints: 
--------------------------------------------------------------------------------
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
  114:     minAgeIn = int(minAgeIn)
  115:     maxAgeIn = int(maxAgeIn)
- 116:     if (minAgeIn >= minAge and maxAgeIn <= maxAge):
+ 116:     if not ((minAgeIn >= minAge and maxAgeIn <= maxAge)):
  117:         return True
  118:     else:
  119:         return False
  120: 
--------------------------------------------------------------------------------
[11.43707 s] survived

   - [#  55] COI constaints: 
--------------------------------------------------------------------------------
  125:     for r in allRooms:
  126:         if room.name == r.name:
  127:             maxO = r.maxO
  128:             break
- 129:     if numOfPeople > maxO:
+ 129:     if not (numOfPeople > maxO):
  130:         return False
  131:     else:
  132:         return True
  133: 
--------------------------------------------------------------------------------
[11.52519 s] survived

   - [#  56] COI constaints: 
--------------------------------------------------------------------------------
  136:     
  137:     
  138:     
  139:     useTimes = []
- 140:     if date == currentDate.date():
+ 140:     if not (date == currentDate.date()):
  141:         for i in allTimes:
  142:             if int(currentDate.strftime('%H')) < int(i.split(':')[0]):
  143:                 useTimes.append(i)
  144:         return useTimes
--------------------------------------------------------------------------------
[11.41929 s] survived

   - [#  57] COI constaints: 
--------------------------------------------------------------------------------
  138:     
  139:     useTimes = []
  140:     if date == currentDate.date():
  141:         for i in allTimes:
- 142:             if int(currentDate.strftime('%H')) < int(i.split(':')[0]):
+ 142:             if not (int(currentDate.strftime('%H')) < int(i.split(':')[0])):
  143:                 useTimes.append(i)
  144:         return useTimes
  145:     else:
  146:         return allTimes
--------------------------------------------------------------------------------
[11.40088 s] survived

   - [#  58] COI constaints: 
--------------------------------------------------------------------------------
  156:     
  157:     
  158:     daysBookings = []
  159:     for i in bookings:
- 160:         if i:
+ 160:         if not i:
  161:             if (i[1] == date and i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
--------------------------------------------------------------------------------
[11.43887 s] survived

   - [#  59] COI constaints: 
--------------------------------------------------------------------------------
  157:     
  158:     daysBookings = []
  159:     for i in bookings:
  160:         if i:
- 161:             if (i[1] == date and i[0].name == room.name):
+ 161:             if not ((i[1] == date and i[0].name == room.name)):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
  165:         if meetLength == 1:
--------------------------------------------------------------------------------
[11.45123 s] survived

   - [#  60] COI constaints: 
--------------------------------------------------------------------------------
  160:         if i:
  161:             if (i[1] == date and i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
- 164:     if not daysBookings:
+ 164:     if not ((not daysBookings)):
  165:         if meetLength == 1:
  166:             return usableTimes
  167:         if meetLength == 2:
  168:             return usableTimes[:9]
--------------------------------------------------------------------------------
[11.40035 s] survived

   - [#  61] COI constaints: 
--------------------------------------------------------------------------------
  161:             if (i[1] == date and i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
- 165:         if meetLength == 1:
+ 165:         if not (meetLength == 1):
  166:             return usableTimes
  167:         if meetLength == 2:
  168:             return usableTimes[:9]
  169:         if meetLength == 3:
--------------------------------------------------------------------------------
[11.41179 s] survived

   - [#  62] COI constaints: 
--------------------------------------------------------------------------------
  163:     
  164:     if not daysBookings:
  165:         if meetLength == 1:
  166:             return usableTimes
- 167:         if meetLength == 2:
+ 167:         if not (meetLength == 2):
  168:             return usableTimes[:9]
  169:         if meetLength == 3:
  170:             return usableTimes[:8]
  171:     
--------------------------------------------------------------------------------
[11.44034 s] survived

   - [#  63] COI constaints: 
--------------------------------------------------------------------------------
  165:         if meetLength == 1:
  166:             return usableTimes
  167:         if meetLength == 2:
  168:             return usableTimes[:9]
- 169:         if meetLength == 3:
+ 169:         if not (meetLength == 3):
  170:             return usableTimes[:8]
  171:     
  172:     avaTimes = []
  173:     addTime = True
--------------------------------------------------------------------------------
[11.42599 s] survived

   - [#  64] COI constaints: 
--------------------------------------------------------------------------------
  170:             return usableTimes[:8]
  171:     
  172:     avaTimes = []
  173:     addTime = True
- 174:     if meetLength == 1:
+ 174:     if not (meetLength == 1):
  175:         for i in usableTimes:
  176:             for j in daysBookings:
  177:                 if j[7] == i:
  178:                     addTime = False
--------------------------------------------------------------------------------
[11.46804 s] survived

   - [#  65] COI constaints: 
--------------------------------------------------------------------------------
  173:     addTime = True
  174:     if meetLength == 1:
  175:         for i in usableTimes:
  176:             for j in daysBookings:
- 177:                 if j[7] == i:
+ 177:                 if not (j[7] == i):
  178:                     addTime = False
  179:             if addTime:
  180:                 avaTimes.append(i)
  181:             addTime = True
--------------------------------------------------------------------------------
[12.25042 s] survived

   - [#  66] COI constaints: 
--------------------------------------------------------------------------------
  175:         for i in usableTimes:
  176:             for j in daysBookings:
  177:                 if j[7] == i:
  178:                     addTime = False
- 179:             if addTime:
+ 179:             if not addTime:
  180:                 avaTimes.append(i)
  181:             addTime = True
  182:     elif meetLength == 2:
  183:         for i in usableTimes[:9]:
--------------------------------------------------------------------------------
[11.45799 s] survived

   - [#  67] COI constaints: 
--------------------------------------------------------------------------------
  178:                     addTime = False
  179:             if addTime:
  180:                 avaTimes.append(i)
  181:             addTime = True
- 182:     elif meetLength == 2:
+ 182:     elif not (meetLength == 2):
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
  185:                 if (j[7] == i or j[7] == str(
  186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
--------------------------------------------------------------------------------
[11.47441 s] survived

   - [#  68] COI constaints: 
--------------------------------------------------------------------------------
  181:             addTime = True
  182:     elif meetLength == 2:
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
- 185:                 if (j[7] == i or j[7] == str(
+ 185:                 if not ((j[7] == i or j[7] == str(
  186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
- 187:                     '%H:%M'))):
+ 187:                     '%H:%M')))):
  188:                     
  189:                     
  190:                     addTime = False
  191:             if addTime:
--------------------------------------------------------------------------------
[11.54072 s] survived

   - [#  70] COI constaints: 
--------------------------------------------------------------------------------
  190:                     addTime = False
  191:             if addTime:
  192:                 avaTimes.append(i)
  193:             addTime = True
- 194:     elif meetLength == 3:
+ 194:     elif not (meetLength == 3):
  195:         for i in usableTimes[:8]:
  196:             for j in daysBookings:
  197:                 if \
  198:                     (j[7] == i or \
--------------------------------------------------------------------------------
[11.49574 s] survived

   - [#  71] COI constaints: 
--------------------------------------------------------------------------------
  193:             addTime = True
  194:     elif meetLength == 3:
  195:         for i in usableTimes[:8]:
  196:             for j in daysBookings:
- 197:                 if \
+ 197:                 if not (\
  198:                     (j[7] == i or \
  199:                     j[7] == \
  200:                     str(
  201:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  204:                     \
  205:                     j[7] == \
  206:                     str(
  207:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=2)).strftime(
- 208:                     '%H:%M'))):
+ 208:                     '%H:%M')))):
  209:                     
  210:                     
  211:                     
  212:                     addTime = False
--------------------------------------------------------------------------------
[11.46553 s] survived

   - [#  73] COI constaints: 
--------------------------------------------------------------------------------
  253: def userBooked(name, phone, date, time, bookings):
  254:     
  255:     
  256:     for booking in bookings:
- 257:         if \
+ 257:         if not (\
  258:             (name == booking[5] and \
  259:             phone == booking[6] and \
  260:             date == booking[1] and \
- 261:             time == booking[7]):
+ 261:             time == booking[7])):
  262:             
  263:             return False
  264:     return True
  265: 
--------------------------------------------------------------------------------
[11.49746 s] survived

   - [#  74] COI constaints: 
--------------------------------------------------------------------------------
  266: 
  267: def checkWeekend(date):
  268:     
  269:     
- 270:     if date.weekday() > 4:
+ 270:     if not (date.weekday() > 4):
  271:         return False
  272:     else:
  273:         return True
  274: 
--------------------------------------------------------------------------------
[11.42891 s] survived

   - [#  75] COI constaints: 
--------------------------------------------------------------------------------
  277:     
  278:     
  279:     minBookTime = now + timedelta(hours=3)
  280:     bookingTime = datetime.strptime(bookingTime, '%H:%M')
- 281:     if (now.date() == dateS and minBookTime.time() > bookingTime.time()):
+ 281:     if not ((now.date() == dateS and minBookTime.time() > bookingTime.time())):
  282:         return False
  283:     else:
  284:         return True
  285: 
--------------------------------------------------------------------------------
[11.46753 s] survived

   - [#  76] COI constaints: 
--------------------------------------------------------------------------------
  285: 
  286: 
  287: def checkNulls(booking):
  288:     for i in booking:
- 289:         if i == '':
+ 289:         if not (i == ''):
  290:             return False
  291:     return True
  292: 
  293: 
--------------------------------------------------------------------------------
[11.42054 s] survived

   - [#  77] COI constaints: 
--------------------------------------------------------------------------------
  309:         'day': day})
  310:     
  311:     
  312:     
- 313:     if response.text == '[]':
+ 313:     if not (response.text == '[]'):
  314:         return True
  315:     else:
  316:         return False
  317: 
--------------------------------------------------------------------------------
[11.41907 s] survived

   - [#  78] COI constaints: 
--------------------------------------------------------------------------------
  320:     
  321:     
  322:     
  323:     date = datetime.strftime(date, '%Y-%m-%d')
- 324:     if room.name == 'Moon':
+ 324:     if not (room.name == 'Moon'):
  325:         i = IsFullMoon()
  326:         return i.set_date_string(date, '%Y-%m-%d').is_full_moon()
  327:     else:
  328:         return True
--------------------------------------------------------------------------------
[11.42660 s] survived

   - [#  79] LCR constaints: 
--------------------------------------------------------------------------------
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
  114:     minAgeIn = int(minAgeIn)
  115:     maxAgeIn = int(maxAgeIn)
- 116:     if (minAgeIn >= minAge and maxAgeIn <= maxAge):
+ 116:     if (minAgeIn >= minAge or maxAgeIn <= maxAge):
  117:         return True
  118:     else:
  119:         return False
  120: 
--------------------------------------------------------------------------------
[11.43269 s] survived

   - [#  80] LCR constaints: 
--------------------------------------------------------------------------------
  157:     
  158:     daysBookings = []
  159:     for i in bookings:
  160:         if i:
- 161:             if (i[1] == date and i[0].name == room.name):
+ 161:             if (i[1] == date or i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
  165:         if meetLength == 1:
--------------------------------------------------------------------------------
[11.45283 s] survived

   - [#  81] LCR constaints: 
--------------------------------------------------------------------------------
  181:             addTime = True
  182:     elif meetLength == 2:
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
- 185:                 if (j[7] == i or j[7] == str(
+ 185:                 if (j[7] == i and j[7] == str(
  186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  187:                     '%H:%M'))):
  188:                     
  189:                     
--------------------------------------------------------------------------------
[11.50602 s] survived

   - [#  82] LCR constaints: 
--------------------------------------------------------------------------------
  194:     elif meetLength == 3:
  195:         for i in usableTimes[:8]:
  196:             for j in daysBookings:
  197:                 if \
- 198:                     (j[7] == i or \
+ 198:                     (j[7] == i and \
  199:                     j[7] == \
  200:                     str(
  201:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
- 202:                     '%H:%M')) or \
+ 202:                     '%H:%M')) and \
  203:                     \
  204:                     \
  205:                     j[7] == \
  206:                     str(
--------------------------------------------------------------------------------
[11.48600 s] survived

   - [#  83] LCR constaints: 
--------------------------------------------------------------------------------
  254:     
  255:     
  256:     for booking in bookings:
  257:         if \
- 258:             (name == booking[5] and \
- 259:             phone == booking[6] and \
- 260:             date == booking[1] and \
+ 258:             (name == booking[5] or \
+ 259:             phone == booking[6] or \
+ 260:             date == booking[1] or \
  261:             time == booking[7]):
  262:             
  263:             return False
  264:     return True
--------------------------------------------------------------------------------
[11.44618 s] survived

   - [#  84] LCR constaints: 
--------------------------------------------------------------------------------
  277:     
  278:     
  279:     minBookTime = now + timedelta(hours=3)
  280:     bookingTime = datetime.strptime(bookingTime, '%H:%M')
- 281:     if (now.date() == dateS and minBookTime.time() > bookingTime.time()):
+ 281:     if (now.date() == dateS or minBookTime.time() > bookingTime.time()):
  282:         return False
  283:     else:
  284:         return True
  285: 
--------------------------------------------------------------------------------
[11.41273 s] survived

   - [#  85] ROR constaints: 
--------------------------------------------------------------------------------
   96: def getRoom(roomName):
   97:     
   98:     
   99:     for room in allRooms:
- 100:         if room.name == roomName:
+ 100:         if room.name != roomName:
  101:             return room
  102:     return False
  103: 
  104: 
--------------------------------------------------------------------------------
[11.42262 s] survived

   - [#  86] ROR constaints: 
--------------------------------------------------------------------------------
  105: def ageRange(room, age):
  106:     
  107:     
  108:     for r in allRooms:
- 109:         if room.name == r.name:
+ 109:         if room.name != r.name:
  110:             maxAge = r.maxAge
  111:             minAge = r.minAge
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
--------------------------------------------------------------------------------
[11.42588 s] survived

   - [#  87] ROR constaints: 
--------------------------------------------------------------------------------
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
  114:     minAgeIn = int(minAgeIn)
  115:     maxAgeIn = int(maxAgeIn)
- 116:     if (minAgeIn >= minAge and maxAgeIn <= maxAge):
+ 116:     if (minAgeIn <= minAge and maxAgeIn <= maxAge):
  117:         return True
  118:     else:
  119:         return False
  120: 
--------------------------------------------------------------------------------
[11.47475 s] survived

   - [#  88] ROR constaints: 
--------------------------------------------------------------------------------
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
  114:     minAgeIn = int(minAgeIn)
  115:     maxAgeIn = int(maxAgeIn)
- 116:     if (minAgeIn >= minAge and maxAgeIn <= maxAge):
+ 116:     if (minAgeIn > minAge and maxAgeIn <= maxAge):
  117:         return True
  118:     else:
  119:         return False
  120: 
--------------------------------------------------------------------------------
[11.43709 s] survived

   - [#  89] ROR constaints: 
--------------------------------------------------------------------------------
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
  114:     minAgeIn = int(minAgeIn)
  115:     maxAgeIn = int(maxAgeIn)
- 116:     if (minAgeIn >= minAge and maxAgeIn <= maxAge):
+ 116:     if (minAgeIn >= minAge and maxAgeIn >= maxAge):
  117:         return True
  118:     else:
  119:         return False
  120: 
--------------------------------------------------------------------------------
[11.38186 s] survived

   - [#  90] ROR constaints: 
--------------------------------------------------------------------------------
  112:             break
  113:     (minAgeIn, maxAgeIn) = age.split('-')
  114:     minAgeIn = int(minAgeIn)
  115:     maxAgeIn = int(maxAgeIn)
- 116:     if (minAgeIn >= minAge and maxAgeIn <= maxAge):
+ 116:     if (minAgeIn >= minAge and maxAgeIn < maxAge):
  117:         return True
  118:     else:
  119:         return False
  120: 
--------------------------------------------------------------------------------
[11.44863 s] survived

   - [#  92] ROR constaints: 
--------------------------------------------------------------------------------
  125:     for r in allRooms:
  126:         if room.name == r.name:
  127:             maxO = r.maxO
  128:             break
- 129:     if numOfPeople > maxO:
+ 129:     if numOfPeople < maxO:
  130:         return False
  131:     else:
  132:         return True
  133: 
--------------------------------------------------------------------------------
[11.43980 s] survived

   - [#  93] ROR constaints: 
--------------------------------------------------------------------------------
  125:     for r in allRooms:
  126:         if room.name == r.name:
  127:             maxO = r.maxO
  128:             break
- 129:     if numOfPeople > maxO:
+ 129:     if numOfPeople >= maxO:
  130:         return False
  131:     else:
  132:         return True
  133: 
--------------------------------------------------------------------------------
[11.46076 s] survived

   - [#  94] ROR constaints: 
--------------------------------------------------------------------------------
  136:     
  137:     
  138:     
  139:     useTimes = []
- 140:     if date == currentDate.date():
+ 140:     if date != currentDate.date():
  141:         for i in allTimes:
  142:             if int(currentDate.strftime('%H')) < int(i.split(':')[0]):
  143:                 useTimes.append(i)
  144:         return useTimes
--------------------------------------------------------------------------------
[11.45425 s] survived

   - [#  95] ROR constaints: 
--------------------------------------------------------------------------------
  138:     
  139:     useTimes = []
  140:     if date == currentDate.date():
  141:         for i in allTimes:
- 142:             if int(currentDate.strftime('%H')) < int(i.split(':')[0]):
+ 142:             if int(currentDate.strftime('%H')) > int(i.split(':')[0]):
  143:                 useTimes.append(i)
  144:         return useTimes
  145:     else:
  146:         return allTimes
--------------------------------------------------------------------------------
[11.45729 s] survived

   - [#  96] ROR constaints: 
--------------------------------------------------------------------------------
  138:     
  139:     useTimes = []
  140:     if date == currentDate.date():
  141:         for i in allTimes:
- 142:             if int(currentDate.strftime('%H')) < int(i.split(':')[0]):
+ 142:             if int(currentDate.strftime('%H')) <= int(i.split(':')[0]):
  143:                 useTimes.append(i)
  144:         return useTimes
  145:     else:
  146:         return allTimes
--------------------------------------------------------------------------------
[11.44876 s] survived

   - [#  97] ROR constaints: 
--------------------------------------------------------------------------------
  157:     
  158:     daysBookings = []
  159:     for i in bookings:
  160:         if i:
- 161:             if (i[1] == date and i[0].name == room.name):
+ 161:             if (i[1] != date and i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
  165:         if meetLength == 1:
--------------------------------------------------------------------------------
[11.40350 s] survived

   - [#  98] ROR constaints: 
--------------------------------------------------------------------------------
  157:     
  158:     daysBookings = []
  159:     for i in bookings:
  160:         if i:
- 161:             if (i[1] == date and i[0].name == room.name):
+ 161:             if (i[1] == date and i[0].name != room.name):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
  165:         if meetLength == 1:
--------------------------------------------------------------------------------
[11.41434 s] survived

   - [#  99] ROR constaints: 
--------------------------------------------------------------------------------
  161:             if (i[1] == date and i[0].name == room.name):
  162:                 daysBookings.append(i)
  163:     
  164:     if not daysBookings:
- 165:         if meetLength == 1:
+ 165:         if meetLength != 1:
  166:             return usableTimes
  167:         if meetLength == 2:
  168:             return usableTimes[:9]
  169:         if meetLength == 3:
--------------------------------------------------------------------------------
[11.38453 s] survived

   - [# 100] ROR constaints: 
--------------------------------------------------------------------------------
  163:     
  164:     if not daysBookings:
  165:         if meetLength == 1:
  166:             return usableTimes
- 167:         if meetLength == 2:
+ 167:         if meetLength != 2:
  168:             return usableTimes[:9]
  169:         if meetLength == 3:
  170:             return usableTimes[:8]
  171:     
--------------------------------------------------------------------------------
[11.46097 s] survived

   - [# 101] ROR constaints: 
--------------------------------------------------------------------------------
  165:         if meetLength == 1:
  166:             return usableTimes
  167:         if meetLength == 2:
  168:             return usableTimes[:9]
- 169:         if meetLength == 3:
+ 169:         if meetLength != 3:
  170:             return usableTimes[:8]
  171:     
  172:     avaTimes = []
  173:     addTime = True
--------------------------------------------------------------------------------
[11.42905 s] survived

   - [# 102] ROR constaints: 
--------------------------------------------------------------------------------
  170:             return usableTimes[:8]
  171:     
  172:     avaTimes = []
  173:     addTime = True
- 174:     if meetLength == 1:
+ 174:     if meetLength != 1:
  175:         for i in usableTimes:
  176:             for j in daysBookings:
  177:                 if j[7] == i:
  178:                     addTime = False
--------------------------------------------------------------------------------
[11.47214 s] survived

   - [# 103] ROR constaints: 
--------------------------------------------------------------------------------
  173:     addTime = True
  174:     if meetLength == 1:
  175:         for i in usableTimes:
  176:             for j in daysBookings:
- 177:                 if j[7] == i:
+ 177:                 if j[7] != i:
  178:                     addTime = False
  179:             if addTime:
  180:                 avaTimes.append(i)
  181:             addTime = True
--------------------------------------------------------------------------------
[11.50151 s] survived

   - [# 104] ROR constaints: 
--------------------------------------------------------------------------------
  178:                     addTime = False
  179:             if addTime:
  180:                 avaTimes.append(i)
  181:             addTime = True
- 182:     elif meetLength == 2:
+ 182:     elif meetLength != 2:
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
  185:                 if (j[7] == i or j[7] == str(
  186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
--------------------------------------------------------------------------------
[11.40905 s] survived

   - [# 105] ROR constaints: 
--------------------------------------------------------------------------------
  181:             addTime = True
  182:     elif meetLength == 2:
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
- 185:                 if (j[7] == i or j[7] == str(
+ 185:                 if (j[7] != i or j[7] == str(
  186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  187:                     '%H:%M'))):
  188:                     
  189:                     
--------------------------------------------------------------------------------
[11.46485 s] survived
