   - [# 106] ROR constaints: 
--------------------------------------------------------------------------------
  181:             addTime = True
  182:     elif meetLength == 2:
  183:         for i in usableTimes[:9]:
  184:             for j in daysBookings:
- 185:                 if (j[7] == i or j[7] == str(
+ 185:                 if (j[7] == i or j[7] != str(
  186:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  187:                     '%H:%M'))):
  188:                     
  189:                     
--------------------------------------------------------------------------------
[11.53857 s] survived

   - [# 107] ROR constaints: 
--------------------------------------------------------------------------------
  190:                     addTime = False
  191:             if addTime:
  192:                 avaTimes.append(i)
  193:             addTime = True
- 194:     elif meetLength == 3:
+ 194:     elif meetLength != 3:
  195:         for i in usableTimes[:8]:
  196:             for j in daysBookings:
  197:                 if \
  198:                     (j[7] == i or \
--------------------------------------------------------------------------------
[11.64224 s] survived

   - [# 108] ROR constaints: 
--------------------------------------------------------------------------------
  194:     elif meetLength == 3:
  195:         for i in usableTimes[:8]:
  196:             for j in daysBookings:
  197:                 if \
- 198:                     (j[7] == i or \
+ 198:                     (j[7] != i or \
  199:                     j[7] == \
  200:                     str(
  201:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  202:                     '%H:%M')) or \
--------------------------------------------------------------------------------
[11.44311 s] survived

   - [# 109] ROR constaints: 
--------------------------------------------------------------------------------
  195:         for i in usableTimes[:8]:
  196:             for j in daysBookings:
  197:                 if \
  198:                     (j[7] == i or \
- 199:                     j[7] == \
+ 199:                     j[7] != \
  200:                     str(
  201:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  202:                     '%H:%M')) or \
  203:                     \
--------------------------------------------------------------------------------
[11.40554 s] survived

   - [# 110] ROR constaints: 
--------------------------------------------------------------------------------
  201:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=1)).strftime(
  202:                     '%H:%M')) or \
  203:                     \
  204:                     \
- 205:                     j[7] == \
+ 205:                     j[7] != \
  206:                     str(
  207:                     (datetime.strptime(i, '%H:%M') + timedelta(hours=2)).strftime(
  208:                     '%H:%M'))):
  209:                     
--------------------------------------------------------------------------------
[11.60869 s] survived

   - [# 111] ROR constaints: 
--------------------------------------------------------------------------------
  254:     
  255:     
  256:     for booking in bookings:
  257:         if \
- 258:             (name == booking[5] and \
+ 258:             (name != booking[5] and \
  259:             phone == booking[6] and \
  260:             date == booking[1] and \
  261:             time == booking[7]):
  262:             
--------------------------------------------------------------------------------
[11.62757 s] survived

   - [# 112] ROR constaints: 
--------------------------------------------------------------------------------
  255:     
  256:     for booking in bookings:
  257:         if \
  258:             (name == booking[5] and \
- 259:             phone == booking[6] and \
+ 259:             phone != booking[6] and \
  260:             date == booking[1] and \
  261:             time == booking[7]):
  262:             
  263:             return False
--------------------------------------------------------------------------------
[11.38859 s] survived

   - [# 113] ROR constaints: 
--------------------------------------------------------------------------------
  256:     for booking in bookings:
  257:         if \
  258:             (name == booking[5] and \
  259:             phone == booking[6] and \
- 260:             date == booking[1] and \
+ 260:             date != booking[1] and \
  261:             time == booking[7]):
  262:             
  263:             return False
  264:     return True
--------------------------------------------------------------------------------
[11.43403 s] survived

   - [# 114] ROR constaints: 
--------------------------------------------------------------------------------
  257:         if \
  258:             (name == booking[5] and \
  259:             phone == booking[6] and \
  260:             date == booking[1] and \
- 261:             time == booking[7]):
+ 261:             time != booking[7]):
  262:             
  263:             return False
  264:     return True
  265: 
--------------------------------------------------------------------------------
[11.45145 s] survived

   - [# 115] ROR constaints: 
--------------------------------------------------------------------------------
  266: 
  267: def checkWeekend(date):
  268:     
  269:     
- 270:     if date.weekday() > 4:
+ 270:     if date.weekday() < 4:
  271:         return False
  272:     else:
  273:         return True
  274: 
--------------------------------------------------------------------------------
[11.48106 s] survived

   - [# 116] ROR constaints: 
--------------------------------------------------------------------------------
  266: 
  267: def checkWeekend(date):
  268:     
  269:     
- 270:     if date.weekday() > 4:
+ 270:     if date.weekday() >= 4:
  271:         return False
  272:     else:
  273:         return True
  274: 
--------------------------------------------------------------------------------
[11.57374 s] survived

   - [# 117] ROR constaints: 
--------------------------------------------------------------------------------
  277:     
  278:     
  279:     minBookTime = now + timedelta(hours=3)
  280:     bookingTime = datetime.strptime(bookingTime, '%H:%M')
- 281:     if (now.date() == dateS and minBookTime.time() > bookingTime.time()):
+ 281:     if (now.date() != dateS and minBookTime.time() > bookingTime.time()):
  282:         return False
  283:     else:
  284:         return True
  285: 
--------------------------------------------------------------------------------
[11.43753 s] survived

   - [# 118] ROR constaints: 
--------------------------------------------------------------------------------
  277:     
  278:     
  279:     minBookTime = now + timedelta(hours=3)
  280:     bookingTime = datetime.strptime(bookingTime, '%H:%M')
- 281:     if (now.date() == dateS and minBookTime.time() > bookingTime.time()):
+ 281:     if (now.date() == dateS and minBookTime.time() < bookingTime.time()):
  282:         return False
  283:     else:
  284:         return True
  285: 
--------------------------------------------------------------------------------
[11.76853 s] survived

   - [# 119] ROR constaints: 
--------------------------------------------------------------------------------
  277:     
  278:     
  279:     minBookTime = now + timedelta(hours=3)
  280:     bookingTime = datetime.strptime(bookingTime, '%H:%M')
- 281:     if (now.date() == dateS and minBookTime.time() > bookingTime.time()):
+ 281:     if (now.date() == dateS and minBookTime.time() >= bookingTime.time()):
  282:         return False
  283:     else:
  284:         return True
  285: 
--------------------------------------------------------------------------------
[11.54623 s] survived

   - [# 120] ROR constaints: 
--------------------------------------------------------------------------------
  285: 
  286: 
  287: def checkNulls(booking):
  288:     for i in booking:
- 289:         if i == '':
+ 289:         if i != '':
  290:             return False
  291:     return True
  292: 
  293: 
--------------------------------------------------------------------------------
[11.43944 s] survived

   - [# 121] ROR constaints: 
--------------------------------------------------------------------------------
  309:         'day': day})
  310:     
  311:     
  312:     
- 313:     if response.text == '[]':
+ 313:     if response.text != '[]':
  314:         return True
  315:     else:
  316:         return False
  317: 
--------------------------------------------------------------------------------
[11.46661 s] survived

   - [# 122] ROR constaints: 
--------------------------------------------------------------------------------
  320:     
  321:     
  322:     
  323:     date = datetime.strftime(date, '%Y-%m-%d')
- 324:     if room.name == 'Moon':
+ 324:     if room.name != 'Moon':
  325:         i = IsFullMoon()
  326:         return i.set_date_string(date, '%Y-%m-%d').is_full_moon()
  327:     else:
  328:         return True
--------------------------------------------------------------------------------
[11.46230 s] survived
